// знайомство з подіями і фц.які називаються хуки/потрібно зробити щоб число збільшувалось і зменшувалось при натискані
// кнопки.На двох кнопка,повісимо обробник події onClick-вона відрізняється унеї є верхній регістер- це синтетисна подія
// і тут вказуємо подію яку вана буде виконувати
// компоненти в реакті мають своє житя-після того як компонент ств.він же фц.
// щоб змінювався counter то потрібно є фція useState(0)вона приймає початкове значення і показує чому=counter
//і вона повертає масив де буде два обєкта 1-це гетерякий буде отримувати інформацію, 2-сетер-через яку цю інформацію будемо змінювати
//якщо у нас є щосьщо нам потрібно змінити принатискані чи при завантпженні тобто з плином часом ,при синхроних подіях,
// useState(0) їх може бути багато але вони повинні по різному називатися.Сетери будуть викор.із силочними даними і там
// повинна бути константа


import {useState} from "react";

const App = () => {

    let [counter,setCounter]=useState(0);
  //   створюємо зміну і виводимо її h2
  console.log('mount');
  return (
      <div>
          <h2>{counter}</h2>
        <button onClick={ ()=>{
            setCounter(++counter);
            // ++counter;
            //  // console.log( "+" )//збільшує
        }}>increment</button>
        {/*але ми не бачимо кнопки тому що їх потрібно в index.css видалити @tailwind base;
          @tailwind components;
          @tailwind utilities; */}
        <button onClick={()=>{

            setCounter(prevState => {
                // можна і тут ще щось задавати обробляти інф. і вставляти
                return prevState - 1;//вона може ретьорнути і сприймати один аргумент,тобто це той стан на даному
                // моменті 0 і це revState дає можливість знати попередній стан і на основі його змінювати свій стан
            });
            // --counter;
            //  // console.log( "-" )це ми не використовуємо
        }}>decrement</button>
      </div>
  );
};

export default App;
// counter можемо визначити ще може приймати колбек фц.